InformationRegisters/КР_ИсходящиеСообщения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>КР_ИсходящиеСообщения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КР_СостоянияСообщенийОбмена</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ТочкаОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Маршрутизация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелоСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логирование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МоментРегистрации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСписокСсылокНаОбъекты</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокСсылокНаОбъекты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПопытокОтправки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелоСообщенияСжатое</Name>
					<Comment>#3553</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>КлючСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/КР_СостоянияСообщенийОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>КР_СостоянияСообщенийОбмена</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Зарегистрировано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КОбработке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обрабатывается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаПроведенияДокумента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УстаревшиеДанные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаСериализации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТаймаутОбработки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаПоискаСсылки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/КР_ИсходящиеСообщения/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// --> Евлахов Игорь Николаевич (Начало) 23.08.2023
	// Задача #3069
	злСобытияФормОценкаПроизводительности.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	// <-- Евлахов Игорь Николаевич (Конец) 23.08.2023
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// --> Евлахов Игорь Николаевич (Начало) 23.08.2023
	// Задача #3069
	злСобытияФормОценкаПроизводительностиКлиент.ПриОткрытии(ЭтаФорма, Отказ);
	// <-- Евлахов Игорь Николаевич (Конец) 23.08.2023
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// << 16.03.2023 Марченко С.Н., КРОК, JIRA№A2105505-1404
	//МассивСсылок = ТекущийОбъект.СписокСсылокНаОбъекты.Получить();    
	//Если ТипЗнч(МассивСсылок) = Тип("Массив") Тогда	
	//	СписокСсылок.ЗагрузитьЗначения(МассивСсылок);
	//КонецЕсли;  
	СписокСсылок.Очистить();
	Если ЗначениеЗаполнено(ТекущийОбъект.СписокСсылокНаОбъекты) Тогда
		МодульКонвертации = КР_ОбщегоНазначениеСервер;		
		Данные = МодульКонвертации.JSONВДанные(ТекущийОбъект.СписокСсылокНаОбъекты); 
		Для Каждого ЭлементМассива Из Данные Цикл 
			СписокСсылок.Добавить(МодульКонвертации.СтруктураВСсылку(ЭлементМассива));
		КонецЦикла;
	КонецЕсли;
	// >> 16.03.2023 Марченко С.Н., КРОК, JIRA№A2105505-1404    
// << 25.12.2023 Петухов А.В., Фактор, #3553
	Если Истина
		И ПустаяСтрока(ТекущийОбъект.ТелоСообщения)
		И ТекущийОбъект.ТелоСообщенияСжатое <> Неопределено
	Тогда
		ТелоСообщения = ТекущийОбъект.ТелоСообщенияСжатое.Получить();
	Иначе
		ТелоСообщения = ТекущийОбъект.ТелоСообщения;
	КонецЕсли;
// >> 25.12.2023 Петухов А.В., Фактор, #3553
	
КонецПроцедуры



&НаКлиенте
Процедура ОтправитьВыделенные(Команда)
	Если Запись.Состояние <> ПредопределенноеЗначение("Перечисление.КР_СостоянияСообщенийОбмена.Зарегистрировано") Тогда
		ТекстВопроса = НСтр("ru='Перевести состояние сообщения в [Зарегистрировано]?'");
		ОписаниеВопроса = Новый ОписаниеОповещения("ОтправитьВыделенныеЗаверешениеВопроса", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеВопроса, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		ОтправитьВыделенныеЗаверешениеВопроса(КодВозвратаДиалога.Да, Неопределено);
	КонецЕсли;
КонецПроцедуры
 
&НаКлиенте
Процедура ОтправитьВыделенныеЗаверешениеВопроса(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		ОтправитьВыделенныеНаСервере();	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьВыделенныеНаСервере()
	
	Запись.Состояние = Перечисления.КР_СостоянияСообщенийОбмена.Зарегистрировано;
	Записать();
	
    МассивСообщений = Новый Массив;	
	МассивСообщений.Добавить(Запись.КлючСообщения);	
	КР_ОбменRabbitВзаимодействиеСАдаптером.ОбменСообщениями(МассивСообщений);
	
	Прочитать();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокСсылокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	ПоказатьЗначение( , ТекущиеДанные.Значение);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
// << 25.12.2023 Петухов А.В., Фактор, #3553
	Если Истина
		И ПустаяСтрока(ТекущийОбъект.ТелоСообщения)
		И ТекущийОбъект.ТелоСообщенияСжатое <> Неопределено
	Тогда
		ТекущийОбъект.ТелоСообщенияСжатое = Новый ХранилищеЗначения(ТелоСообщения, Новый СжатиеДанных (9));
	Иначе
		ТекущийОбъект.ТелоСообщения = ТелоСообщения;
	КонецЕсли;
// >> 25.12.2023 Петухов А.В., Фактор, #3553
КонецПроцедуры

#КонецОбласти
